const isProduction = process.env.NODE_ENV === "production";
const prefix = isProduction ? '/greeting-card' : '';

const slides = [
  {
    text: `
      В неї очі янтарно смарагдові,
      Її губи на смак як пуер,
      Ці волосся, кудлаті, привабливі,
      Що знаходжу я в ліжку тепер... `,
    background: `url('${prefix}/images/1.png')`
  },
  {
    text: `
      Ці дбайливі, ласкаві долоні,
      Тонкі пальці, брови чорняві,
      Мене ніжно тримають в полоні
      В головній ролі у цій виставі.`,
    background: `url('${prefix}/images/qvi.gif')`
  },
  {
    text: `
      Поруч з нею я в космос злітаю,
      Щоб зірки позбирати для нас,
      Під ногами я землю втрачаю,
      Та так міцно стою в одночас`,
    background: `url('${prefix}/images/3.png')`
  },
  {
    text: `
      Все навколо магічним чином
      Без супротиву їй підкоряється.
      З нею час по-інакшому плине,
      Інші сенси в житті зʼявляються.`,
    background: `url('${prefix}/images/4.png')`
  },
  {
    text: `
      Коли я загублюсь у тиші,
      Вона знайде мене наосліп,
      Сяйвом сонячним заполонивши
      Суматошний похмурий простір.`,
    background: `url('${prefix}/images/5.png')`
  },
  {
    text: `
      Врятувала, знайшла і зцілила
      Серце вкрите глибокими шрамами,
      Я його віддаю бережливо,
      І пірнаю в волосся каштанове.`,
    background: `url('${prefix}/images/6.png')`
  },
  {
    text: `
      Ми зустрілись в цей час не даремно,
      І позбувшись всіх зайвих тривог,
      Проміж нами кликоче буремно
      Це дихання - одне на двох`,
    background: `url('${prefix}/images/7.png')`
  },
  {
    text: `
       Київ, 19.12.2024.`,
    background: `url('${prefix}/images/2.png')`
  },
];

export default slides;
